require "selenium-webdriver"

def url
  "https://www.zeirishikensaku.jp/z_top2.asp"
end

def move_to_next_page(driver, original_window, new_window)
  # ここからページネーションを調べてnextにいく処理
  driver.switch_to.window(original_window)

  page_elements = driver.find_elements(class: "PAGE")
  pagenation = page_elements[1]

  pagenation_links = pagenation.find_elements(tag_name: "a")
  if pagenation_links[pagenation_links.length - 1]
    pagenation_links[pagenation_links.length - 1].click
  else
    driver.close
    return
  end

  driver.switch_to.window(new_window)
end

def calc_pagenation_count(driver, original_window)
  driver.switch_to.window(original_window)
  
  page_elements = driver.find_elements(class: "PAGE")
  search_count_result = page_elements[2].find_element(tag_name: "font") # 件数 22件など
  count = search_count_result.text.to_i # 例えばcount = 22だったらページ遷移は2回, count = 1 ~ 10だったらページ遷移は0回
  trial_times = 0
  
  # ex) 検索結果 = count = 9件だったら、ページ遷移は0回。22件だったら、ページ遷移は2回
  while count > 10
    count -= 10
    trial_times += 1
  end
  
  trial_times
end

def scrape(location)
  options = Selenium::WebDriver::Firefox::Options.new
  options.add_argument('-headless')
  driver = Selenium::WebDriver.for :firefox, options: options
  driver.get url
  sleep 1
  atags = driver.find_elements(tag_name: "a")
  a = atags[5]
  driver.execute_script("arguments[0].click();", a)
  sleep 2
  driver.execute_script("javascript:onclick=jf_SearchClick(1);")
  sleep 1
  trs = driver.find_elements(tag_name: "tr")
  
  new_window = driver.window_handles.last
  driver.close
  # 取得した新規ウィンドウのハンドルに移動
  driver.switch_to.window(new_window)
  sleep 1
  
  trs = driver.find_elements(tag_name: "tr")
  
  input_buttons = driver.find_elements(tag_name: "input")
  input_buttons[4].click # 事務所所在地のラジオボタンをクリック
  sleep 1
  input_buttons[1].send_keys(location)
  sleep 1
  
  # 検索ボタンをクリック
  a_buttons = driver.find_elements(tag_name: "a")
  a_buttons[2].click
  
  # 検索結果が100件以上を越える場合、もしくは0件の場合、アラートが出る
  begin
    if dialog = driver.switch_to.alert
      puts location
      if dialog.text.include?('100件を超えています')
        puts "検索結果が100件を超えたのでスクレイピングできません"
      elsif dialog.text.include?('該当するデータはありません')
        puts "検索結果が0件でした。スクレイピングできません"
      end
      dialog.accept
      driver.close
      return
    end
  rescue => e
  end

  current_window = driver.window_handles.last

  # ページ遷移する回数 + 1ページ目の数だけ処理をループさせる
  trial_times = calc_pagenation_count(driver, current_window) + 1
  trial_times.times do |i|

    driver.switch_to.window(current_window)
    # 税理士の情報がテーブル要素に記述されているので、tag_name: "tr"でまとめて取得
    search_result_of_accountants_list = driver.find_elements(tag_name: "tr")
    # tax_accountant_table_data_listの最初の3つはテーブル外の要素なので除外
    search_result_of_accountants_list.delete(search_result_of_accountants_list[0])
    search_result_of_accountants_list.delete(search_result_of_accountants_list[0])
    search_result_of_accountants_list.delete(search_result_of_accountants_list[0])
  
    search_result_of_accountants_list.each do |tr|
      each_accountant_data_table = tr.find_elements(tag_name: "td")
      each_accountant_data_table_length = each_accountant_data_table.length
  
      # tr > td, td, ...となっているが、このtdの最後の要素が個別の税理士ページへのリンクになるので、そこだけ取得する
      show_link = each_accountant_data_table[each_accountant_data_table_length - 1].find_element(tag_name: "a")
      # 個別の税理士の詳細ページに遷移
      show_link.click
      sleep 2
      # リンクをクリックするとアラートが出るので処理
      dialog = driver.switch_to.alert
      if dialog.text == '利用条件に同意しますか？'
        dialog.accept
      else
        dialog.dismiss
      end

      sleep 2
      # 税理士の詳細ページにdriverのフォーカスを切り替えるため
      new_window = driver.window_handles.last
      driver.switch_to.window(new_window)
      sleep 1

      accountant_data_tables = driver.find_elements(tag_name: "tbody")
      # はじめに検索地域名を表示する
      puts location
      # 必要なデータは基本情報のテーブルと、メールアドレス名などの連絡先のデータのテーブルのみ
      2.times.each do |i|
        personal_info_trs = accountant_data_tables[i].find_elements(tag_name: "tr")
        personal_info_trs.delete(personal_info_trs[0])
        personal_info_trs.each do |tr|
          # 各trにtdが2つ以上ある
          tds = tr.find_elements(tag_name: "td")
          # 1番目はカラムのタイトルなので削除
          tds.delete(tds[0])

          if tds[0].text.length.zero?
            puts "xxx"
          else
            puts tds[0].text
          end
        end
      end
      driver.switch_to.window(current_window)
    end

    sleep 1
    move_to_next_page(driver, current_window, new_window)
    # driver.switch_to.window(current_window)
  end
  driver.quit
end

# 山梨県北杜市: 1ページ, 下北沢: 2ページ、恵比寿南: 3ページ、東京都: 100件超え、めんそーれ: ヒットせず
# scrape("めんそーれ")
# scrape("山梨県北杜市")
# scrape("下北沢")
# scrape("恵比寿南")
# scrape("東京都")

locations = ["京都市北区出雲路神楽町", "京都市北区出雲路立テ本町", "京都市北区出雲路俵町", "京都市北区出雲路松ノ下町", "京都市北区大北山鏡石町", "京都市北区大北山天神岡町", "京都市北区大北山蓮ケ谷町", "京都市北区大北山長谷町", "京都市北区大北山原谷乾町", "京都市北区大北山不動山町", "京都市北区大宮一ノ井町", "京都市北区大宮上ノ岸町", "京都市北区大宮北椿原町", "京都市北区大宮北ノ岸町", "京都市北区大宮北箱ノ井町", "京都市北区大宮北林町", "京都市北区大宮北山ノ前町", "京都市北区大宮玄琢北東町", "京都市北区大宮玄琢北町", "京都市北区大宮玄琢南町", "京都市北区大宮釈迦谷", "京都市北区大宮田尻町", "京都市北区大宮土居町", "京都市北区大宮中総門口町", "京都市北区大宮中ノ社町", "京都市北区大宮中林町", "京都市北区大宮西小野堀町", "京都市北区大宮西総門口町", "京都市北区大宮西野山町", "京都市北区大宮西山ノ前町", "京都市北区大宮西脇台町", "京都市北区大宮東小野堀町", "京都市北区大宮東総門口町", "京都市北区大宮東脇台町", "京都市北区大宮開町", "京都市北区大宮南田尻町", "京都市北区大宮南椿原町", "京都市北区大宮南箱ノ井町", "京都市北区大宮南林町", "京都市北区大宮南山ノ前町", "京都市北区大宮薬師山西町", "京都市北区大宮薬師山東町", "京都市北区大森芦堂町", "京都市北区大森稲荷", "京都市北区大森中町", "京都市北区大森西町", "京都市北区大森東町", "京都市北区小野岩戸", "京都市北区小野上ノ町", "京都市北区小野下ノ町", "京都市北区小野中ノ町", "京都市北区小野宮ノ上町", "京都市北区上賀茂葵田町", "京都市北区上賀茂葵之森町", "京都市北区上賀茂赤尾町", "京都市北区上賀茂朝露ケ原町", "京都市北区上賀茂畔勝町", "京都市北区上賀茂荒草町", "京都市北区上賀茂池殿町", "京都市北区上賀茂池端町", "京都市北区上賀茂石計町", "京都市北区上賀茂壱町口町", "京都市北区上賀茂今井河原町", "京都市北区上賀茂岩ケ垣内町", "京都市北区上賀茂馬ノ目町", "京都市北区上賀茂梅ケ辻町", "京都市北区上賀茂烏帽子ケ垣内町", "京都市北区上賀茂大柳町", "京都市北区上賀茂岡本口町", "京都市北区上賀茂岡本町", "京都市北区上賀茂音保瀬町", "京都市北区上賀茂上神原町", "京都市北区上賀茂北大路町", "京都市北区上賀茂北ノ原町", "京都市北区上賀茂毛穴井町", "京都市北区上賀茂ケシ山", "京都市北区上賀茂神山", "京都市北区上賀茂榊田町", "京都市北区上賀茂坂口町", "京都市北区上賀茂桜井町", "京都市北区上賀茂下神原町", "京都市北区上賀茂十三石山", "京都市北区上賀茂菖蒲園町", "京都市北区上賀茂蝉ケ垣内町", "京都市北区上賀茂高縄手町", "京都市北区上賀茂竹ケ鼻町", "京都市北区上賀茂土門町", "京都市北区上賀茂津ノ国町", "京都市北区上賀茂豊田町", "京都市北区上賀茂中大路町", "京都市北区上賀茂中嶋河原町", "京都市北区上賀茂中ノ河原町", "京都市北区上賀茂中ノ坂町", "京都市北区上賀茂中山町", "京都市北区上賀茂二軒家町", "京都市北区上賀茂西上之段町", "京都市北区上賀茂西河原町", "京都市北区上賀茂西後藤町", "京都市北区上賀茂狭間町", "京都市北区上賀茂柊谷町", "京都市北区上賀茂東上之段町", "京都市北区上賀茂東後藤町", "京都市北区上賀茂備後田町", "京都市北区上賀茂藤ノ木町", "京都市北区上賀茂舟着町", "京都市北区上賀茂前田町", "京都市北区上賀茂松本町", "京都市北区上賀茂御薗口町", "京都市北区上賀茂深泥池町", "京都市北区上賀茂南大路町", "京都市北区上賀茂向梅町", "京都市北区上賀茂向縄手町", "京都市北区上賀茂女夫岩町", "京都市北区上賀茂本山", "京都市北区上賀茂薮田町", "京都市北区上賀茂山本町", "京都市北区上賀茂六段田町", "京都市北区上御霊上江町", "京都市北区上清蔵口町", "京都市北区北野上白梅町", "京都市北区北野紅梅町", "京都市北区北野下白梅町", "京都市北区北野西白梅町", "京都市北区北野東紅梅町", "京都市北区衣笠赤阪町", "京都市北区衣笠荒見町", "京都市北区衣笠大祓町", "京都市北区衣笠街道町", "京都市北区衣笠鏡石町", "京都市北区衣笠北荒見町", "京都市北区衣笠北高橋町", "京都市北区衣笠北天神森町", "京都市北区衣笠衣笠山町", "京都市北区衣笠御所ノ内町", "京都市北区衣笠総門町", "京都市北区衣笠高橋町", "京都市北区衣笠天神森町", "京都市北区衣笠西御所ノ内町", "京都市北区衣笠西尊上院町", "京都市北区衣笠西馬場町", "京都市北区衣笠西開キ町", "京都市北区衣笠馬場町", "京都市北区衣笠東御所ノ内町", "京都市北区衣笠東尊上院町", "京都市北区衣笠東開キ町", "京都市北区衣笠氷室町", "京都市北区衣笠開キ町", "京都市北区金閣寺町", "京都市北区雲ケ畑出谷町", "京都市北区雲ケ畑中津川町", "京都市北区雲ケ畑中畑町", "京都市北区鞍馬口町", "京都市北区小松原北町", "京都市北区小松原南町", "京都市北区小山板倉町", "京都市北区小山上板倉町", "京都市北区小山上内河原町", "京都市北区小山上初音町", "京都市北区小山上花ノ木町", "京都市北区小山上総町", "京都市北区小山北大野町", "京都市北区小山北上総町", "京都市北区小山北玄以町", "京都市北区小山下板倉町", "京都市北区小山下内河原町", "京都市北区小山下初音町", "京都市北区小山下花ノ木町", "京都市北区小山下総町", "京都市北区小山町", "京都市北区小山中溝町", "京都市北区小山西大野町", "京都市北区小山西上総町", "京都市北区小山西玄以町", "京都市北区小山西花池町", "京都市北区小山西元町", "京都市北区小山初音町", "京都市北区小山花ノ木町", "京都市北区小山東大野町", "京都市北区小山東玄以町", "京都市北区小山東花池町", "京都市北区小山東元町", "京都市北区小山堀池町", "京都市北区小山南大野町", "京都市北区小山南上総町", "京都市北区小山元町", "京都市北区紫竹牛若町", "京都市北区紫竹上梅ノ木町", "京都市北区紫竹上高才町", "京都市北区紫竹上芝本町", "京都市北区紫竹上園生町", "京都市北区紫竹上竹殿町", "京都市北区紫竹上長目町", "京都市北区紫竹上ノ岸町", "京都市北区紫竹上堀川町", "京都市北区紫竹上本町", "京都市北区紫竹上緑町", "京都市北区紫竹北栗栖町", "京都市北区紫竹北大門町", "京都市北区紫竹栗栖町", "京都市北区紫竹下梅ノ木町", "京都市北区紫竹下高才町", "京都市北区紫竹下芝本町", "京都市北区紫竹下園生町", "京都市北区紫竹下竹殿町", "京都市北区紫竹下長目町", "京都市北区紫竹下ノ岸町", "京都市北区紫竹下本町", "京都市北区紫竹下緑町", "京都市北区紫竹西南町", "京都市北区紫竹西北町", "京都市北区紫竹大門町", "京都市北区紫竹高縄町", "京都市北区紫竹竹殿町", "京都市北区紫竹西栗栖町", "京都市北区紫竹西大門町", "京都市北区紫竹西高縄町", "京都市北区紫竹西野山町", "京都市北区紫竹西野山東町", "京都市北区紫竹西桃ノ本町", "京都市北区紫竹東栗栖町", "京都市北区紫竹東大門町", "京都市北区紫竹東高縄町", "京都市北区紫竹東桃ノ本町", "京都市北区紫竹桃ノ本町", "京都市北区上善寺門前町", "京都市北区新御霊口町", "京都市北区杉阪北尾", "京都市北区杉阪道風町", "京都市北区杉阪都町", "京都市北区大将軍一条町", "京都市北区大将軍川端町", "京都市北区大将軍坂田町", "京都市北区大将軍西鷹司町", "京都市北区大将軍西町", "京都市北区大将軍東鷹司町", "京都市北区大将軍南一条町", "京都市北区鷹峯大谷町", "京都市北区鷹峯上ノ町", "京都市北区鷹峯北鷹峯町", "京都市北区鷹峯木ノ畑町", "京都市北区鷹峯旧土居町", "京都市北区鷹峯黒門町", "京都市北区鷹峯光悦町", "京都市北区鷹峯千束町", "京都市北区鷹峯土天井町", "京都市北区鷹峯堂ノ庭町", "京都市北区鷹峯藤林町", "京都市北区鷹峯仏谷", "京都市北区鷹峯堀越町", "京都市北区鷹峯南鷹峯町", "京都市北区長乗西町", "京都市北区長乗東町", "京都市北区天寧寺門前町", "京都市北区等持院北町", "京都市北区等持院中町", "京都市北区等持院西町", "京都市北区等持院東町", "京都市北区等持院南町", "京都市北区中川川登", "京都市北区中川北山町", "京都市北区中川中山", "京都市北区中川西山", "京都市北区中川東山", "京都市北区西賀茂井ノ口町", "京都市北区西賀茂今原町", "京都市北区西賀茂大栗町", "京都市北区西賀茂大道口町", "京都市北区西賀茂大深町", "京都市北区西賀茂蛙ケ谷", "京都市北区西賀茂柿ノ木町", "京都市北区西賀茂笠松", "京都市北区西賀茂蟹ケ坂町", "京都市北区西賀茂鹿ノ下町", "京都市北区西賀茂上庄田町", "京都市北区西賀茂川上町", "京都市北区西賀茂北今原町", "京都市北区西賀茂北川上町", "京都市北区西賀茂北鎮守菴町", "京都市北区西賀茂北山ノ森町", "京都市北区西賀茂下庄田町", "京都市北区西賀茂城山", "京都市北区西賀茂神光院町", "京都市北区西賀茂角社町", "京都市北区西賀茂鎮守菴町", "京都市北区西賀茂中川上町", "京都市北区西賀茂西氷室町", "京都市北区西賀茂榿ノ木町", "京都市北区西賀茂樋ノ口町", "京都市北区西賀茂氷室町", "京都市北区西賀茂船山", "京都市北区西賀茂坊ノ後町", "京都市北区西賀茂蓬来谷", "京都市北区西賀茂丸川町", "京都市北区西賀茂円峰", "京都市北区西賀茂水垣町", "京都市北区西賀茂南今原町", "京都市北区西賀茂南大栗町", "京都市北区西賀茂南川上町", "京都市北区西賀茂山ノ森町", "京都市北区西賀茂鑓磨岩", "京都市北区平野上八丁柳町", "京都市北区平野上柳町", "京都市北区平野桜木町", "京都市北区平野鳥居前町", "京都市北区平野八丁柳町", "京都市北区平野東柳町", "京都市北区平野宮北町", "京都市北区平野宮敷町", "京都市北区平野宮西町", "京都市北区平野宮本町", "京都市北区真弓善福", "京都市北区真弓八幡町", "京都市北区紫野今宮町", "京都市北区紫野上野町", "京都市北区紫野雲林院町", "京都市北区紫野上柏野町", "京都市北区紫野上御所田町", "京都市北区紫野上石龍町", "京都市北区紫野上築山町", "京都市北区紫野上鳥田町", "京都市北区紫野上御輿町", "京都市北区紫野上門前町", "京都市北区紫野上柳町", "京都市北区紫野上若草町", "京都市北区紫野北花ノ坊町", "京都市北区紫野北舟岡町", "京都市北区紫野郷ノ上町", "京都市北区紫野下柏野町", "京都市北区紫野下石龍町", "京都市北区紫野下築山町", "京都市北区紫野下鳥田町", "京都市北区紫野下御輿町", "京都市北区紫野下門前町", "京都市北区紫野下柳町", "京都市北区紫野下若草町", "京都市北区紫野十二坊町", "京都市北区紫野石龍町", "京都市北区紫野泉堂町", "京都市北区紫野大徳寺町", "京都市北区紫野中柏野町", "京都市北区紫野西御所田町", "京都市北区紫野西泉堂町", "京都市北区紫野西土居町", "京都市北区紫野西野町", "京都市北区紫野西藤ノ森町", "京都市北区紫野西舟岡町", "京都市北区紫野西蓮台野町", "京都市北区紫野花ノ坊町", "京都市北区紫野東御所田町", "京都市北区紫野東泉堂町", "京都市北区紫野東野町", "京都市北区紫野東藤ノ森町", "京都市北区紫野東舟岡町", "京都市北区紫野東蓮台野町", "京都市北区紫野南花ノ坊町", "京都市北区紫野南舟岡町", "京都市北区紫野宮西町", "京都市北区紫野宮東町", "京都市北区紫野門前町"]

locations.each do |location|
  scrape(location)
end